STMicroelectronics/STM32CubeWB/Projects/P-NUCLEO-WB55.Nucleo/Applications/Zigbee/Zigbee_Commissioning_Client_Coord/STM32_WPAN/App/app_zigbee.c
/**
  ******************************************************************************
  * File Name          : App/app_zigbee.c
  * Description        : Zigbee Application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2019-2021 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/
#include "app_common.h"
#include "app_entry.h"
#include "dbg_trace.h"
#include "app_zigbee.h"
#include "zigbee_interface.h"
#include "shci.h"
#include "stm_logging.h"
#include "app_conf.h"
#include "stm32wbxx_core_interface_def.h"
#include "zigbee_types.h"
#include "stm32_seq.h"

#include <assert.h>
#include "zcl/zcl.h"
#include "zcl/general/zcl.commission.h"

/* Private defines -----------------------------------------------------------*/
#define APP_ZIGBEE_STARTUP_FAIL_DELAY               500U

/* Commissioning specific defines -------------------------------------------------*/
#define ZR_NWK_ADDR                                  0xffff /* unspecified */
#define ZR_EXT_ADDR                                  (uint64_t)0x1111111111111111
#define ZR_NB_SCANS                                  1
#define ZR_RESTART_DEVICE_DELAY                      1 /* 1 second */
#define ZB_PANID_WILDCARD                            0xffff

#define NB_NWK_CONFIG                                1
#define CHANNEL_1                                    19
#define EXT_PANID_1                                  0x1122334455667788
#define ZR_COMMISSIONING_SERVER_INDEX_NWK_1          0
#define COMMISSIONING_DEST_ENDPOINT                  ZB_ENDPOINT_BCAST 
/* external definition */
enum ZbStatusCodeT ZbStartupWait(struct ZigBeeT *zb, struct ZbStartupT *config);

/* NWK parameters handled by Commissioning client */
struct nwk_parameters{
  uint64_t extendedPanID;
  uint32_t channelMask;
  uint16_t nwk_addr;
  uint8_t nwkKeyType; 
  uint8_t stackProfile;
  uint8_t scan_count;
  uint8_t startupControl;
  bool useInsecureJoin;
};

/* ZC NWK configuration structure */
struct zigbee_nwk_config {
  uint8_t currentConfig;
  struct nwk_parameters config[NB_NWK_CONFIG];
};

/* Private function prototypes -----------------------------------------------*/
static void APP_ZIGBEE_StackLayersInit(void);
static void APP_ZIGBEE_ConfigEndpoints(void);
static void APP_ZIGBEE_NwkForm(void);
static void APP_ZIGBEE_SW1_Process(void);
static void APP_ZIGBEE_App_Init(void);

static void APP_ZIGBEE_Commissioning_Client_Init(void);
static void APP_ZIGBEE_Commissioning_Cmd_Rsp_Mgmt(struct ZbZclCommandRspT *zcl_rsp);
static void APP_ZIGBEE_Generic_Cmd_Rsp_cb(struct ZbZclCommandRspT *zcl_rsp, void *arg);

static void APP_ZIGBEE_Commissioning_Client_RemoteWrite_cb(const ZbZclWriteRspT *writeResp, void *cb_arg);
static void APP_ZIGBEE_NwkInfo(void);
static void APP_ZIGBEE_Commissioning_Client_SetNwkCfg_cmd(uint8_t config_num, struct nwk_parameters *params);

static void APP_ZIGBEE_TraceError(const char *pMess, uint32_t ErrCode);
static void APP_ZIGBEE_CheckWirelessFirmwareInfo(void);

static void Wait_Getting_Ack_From_M0(void);
static void Receive_Ack_From_M0(void);
static void Receive_Notification_From_M0(void);

/* Private variables -----------------------------------------------*/
static TL_CmdPacket_t *p_ZIGBEE_otcmdbuffer;
static TL_EvtPacket_t *p_ZIGBEE_notif_M0_to_M4;
static TL_EvtPacket_t *p_ZIGBEE_request_M0_to_M4;
static __IO uint32_t CptReceiveNotifyFromM0 = 0;
static __IO uint32_t CptReceiveRequestFromM0 = 0;

PLACE_IN_SECTION("MB_MEM1") ALIGN(4) static TL_ZIGBEE_Config_t ZigbeeConfigBuffer;
PLACE_IN_SECTION("MB_MEM2") ALIGN(4) static TL_CmdPacket_t ZigbeeOtCmdBuffer;
PLACE_IN_SECTION("MB_MEM2") ALIGN(4) static uint8_t ZigbeeNotifRspEvtBuffer[sizeof(TL_PacketHeader_t) + TL_EVT_HDR_SIZE + 255U];
PLACE_IN_SECTION("MB_MEM2") ALIGN(4) static uint8_t ZigbeeNotifRequestBuffer[sizeof(TL_PacketHeader_t) + TL_EVT_HDR_SIZE + 255U];

struct zigbee_app_info {
  bool has_init;
  struct ZigBeeT *zb;
  enum ZbStartType startupControl;
  enum ZbStatusCodeT join_status;
  uint32_t join_delay;

  struct ZbZclClusterT *commissioning_client;
};
static struct zigbee_app_info zigbee_app_info;

static struct zigbee_nwk_config nwk_config = {
  /* Starting with network configuration 1 */
  .currentConfig = ZR_COMMISSIONING_SERVER_INDEX_NWK_1,
  
  /* nwk 1 parameters */
  .config[0].extendedPanID = EXT_PANID_1,
  .config[0].channelMask = CHANNEL_1,
  .config[0].nwk_addr = ZR_NWK_ADDR,
  .config[0].nwkKeyType = ZB_SEC_KEYTYPE_STANDARD_NWK,
  .config[0].stackProfile = ZB_NWK_STACK_PROFILE_PRO,
  .config[0].scan_count = ZR_NB_SCANS,
  .config[0].startupControl = ZbStartTypeJoin,
  .config[0].useInsecureJoin = true,
};


/* Functions Definition ------------------------------------------------------*/

/**
 * @brief  Device generic command response callback
 * @param  zcl_rsp: ZCL response
 * @param  arg: passed arguments
 * @retval None
 */
static void APP_ZIGBEE_Generic_Cmd_Rsp_cb(struct ZbZclCommandRspT *zcl_rsp, void *arg){
  UNUSED(arg);
  
  /* Checking response consistency */
  assert(zcl_rsp != NULL);
  
  switch(zcl_rsp->hdr.frameCtrl.frameType){
    case ZCL_FRAMETYPE_PROFILE:
      /* general frame cmd response */   
      
      switch(zcl_rsp->hdr.cmdId){
        case ZCL_COMMAND_DEFAULT_RESPONSE:
          /* general default response */
          if (zcl_rsp->status != ZCL_STATUS_SUCCESS) {
            APP_DBG("Default response: the server returned an error: 0x%02x.\n", zcl_rsp->status);
          } else {
            APP_DBG("Default response: success!\n");
          }
         break;
         
         default:
          APP_DBG("Error: unsupported general cmd type.\n");
          break;
      }
      break;
      
    case ZCL_FRAMETYPE_CLUSTER:
      /* cluster specific frame cmd response */
      
      if(zcl_rsp->status != ZCL_STATUS_SUCCESS){
        APP_DBG("Error: cmd not successfully received. 0x%02x.\n", zcl_rsp->status);
        return;
      }
      
      switch(zcl_rsp->clusterId){
        case ZCL_CLUSTER_COMMISSIONING:
          /* Commissioning cluster */
          APP_ZIGBEE_Commissioning_Cmd_Rsp_Mgmt(zcl_rsp);
          break;
         
         default:
          APP_DBG("Error: unsupported cluster.\n");
          break;
      }
      break;
      
    default:
      APP_DBG("Error: unsupported frame type.\n");
      break;
  }
} /* APP_ZIGBEE_Generic_Cmd_Rsp_cb */

/**
 * @brief  Commissioning client command response management
 * @param  zcl_rsp: ZCL response
 * @retval None
 */
static void APP_ZIGBEE_Commissioning_Cmd_Rsp_Mgmt(struct ZbZclCommandRspT *zcl_rsp){
  uint8_t rsp_status = 0;
  
