STMicroelectronics/STM32CubeWB/Projects/P-NUCLEO-WB55.Nucleo/Applications/Zigbee/Zigbee_Commissioning_Client_Coord/STM32_WPAN/App/app_zigbee.c
  /* Checking response consistency */
  assert(zcl_rsp != NULL && zcl_rsp->payload != NULL);
  
  memcpy(&rsp_status, zcl_rsp->payload, sizeof(rsp_status));
  switch(zcl_rsp->hdr.cmdId){
    case ZCL_COMMISSION_SVR_CMD_RESTART_DEVICE_RSP:
      /* Commissioning restart device cmd response */
      APP_DBG("RestartDevice response received from server.");
      if(rsp_status != ZCL_STATUS_SUCCESS){
        APP_DBG("Error, server did not handle the request successfully. Error code 0x%2x", rsp_status);
        return;
      }
      break;
      
    case ZCL_COMMISSION_SVR_CMD_SAVE_STARTUP_RSP:
      /* Commissioning save startup cmd response */
      APP_DBG("SaveStartup response received from server.");
      if(rsp_status != ZCL_STATUS_SUCCESS){
        APP_DBG("Error, server did not handle the request successfully. Error code 0x%2x", rsp_status);
        return;
      }
      break;
      
    case ZCL_COMMISSION_SVR_CMD_RESTORE_STARTUP_RSP:
      /* Commissioning restore startup cmd response */
      APP_DBG("RestoreStartup response received from server.");
      if(rsp_status != ZCL_STATUS_SUCCESS){
        APP_DBG("Error, server did not handle the request successfully. Error code 0x%2x", rsp_status);
        return;
      }
      break;
      
    case ZCL_COMMISSION_SVR_CMD_RESET_STARTUP_RSP:
      /* Commissioning reset startup cmd response */
      APP_DBG("ResetStartup response received from server.");
      if(rsp_status != ZCL_STATUS_SUCCESS){
        APP_DBG("Error, server did not handle the request successfully. Error code 0x%2x", rsp_status);
        return;
      }
      break;
             
    default:
      APP_DBG("Error: unsupported general cmd type.\n");
      return;
    }
  
  APP_DBG("Response is OK, continue Commissioning process.\n");

  /* Continue the Commissioning process */
  UTIL_SEQ_SetEvt(EVENT_ZIGBEE_CONTINUE_INIT);
} /* APP_ZIGBEE_Commissioning_Cmd_Rsp_Mgmt */

/**
 * @brief  Zigbee application helper to configure Commissioning server
 * @param  config_num: Current NWK commissioning client NWK configuration
 * @param  params: Corresponding NWK parameters
 * @retval None
 */
static void APP_ZIGBEE_Commissioning_Client_SetNwkCfg_cmd(uint8_t config_num, struct nwk_parameters *params){
  enum ZclStatusCodeT status;  
  struct ZbZclCommissionClientResetStartup ResetStartupReq; 
  struct ZbZclCommissionClientSaveStartup SaveStartupReq;
  struct ZbZclCommissionClientRestoreStartup RestoreStartup;
  struct ZbZclCommissionClientRestartDev RestartDeviceReq;
  ZbZclWriteReqT RemoteWriteReq;
  uint64_t epid;
  uint32_t channelMask;
  uint16_t nwk_addr;
  
  /* Resetting Commissioning client nwk configuration */
  APP_DBG("Sending ResetStartup request."); 
  memset(&ResetStartupReq, 0, sizeof(ResetStartupReq));
  status = ZbZclCommissionClientSendResetStartup(zigbee_app_info.commissioning_client, ZR_EXT_ADDR, COMMISSIONING_DEST_ENDPOINT ,&ResetStartupReq,
                                                 APP_ZIGBEE_Generic_Cmd_Rsp_cb, NULL);
  if (status != ZCL_STATUS_SUCCESS) {
    APP_DBG("Error, ZbZclCommissionClientSendResetStartup failed");
    assert(0);
  }
  
  /* Waiting the successful server response */
  UTIL_SEQ_WaitEvt(EVENT_ZIGBEE_CONTINUE_INIT);
  
  /* Remotely writing Commissioning client nwk configuration (request 1) */
  memset(&RemoteWriteReq, 0, sizeof(RemoteWriteReq));
  RemoteWriteReq.dst.mode = ZB_APSDE_ADDRMODE_EXT;
  /* We want to address any device with INTERPAN, 
   * even if not connected to ZC's network */
  RemoteWriteReq.dst.panId = ZB_PANID_WILDCARD; /* wildcard value */
  RemoteWriteReq.dst.extAddr = ZR_EXT_ADDR;
  RemoteWriteReq.dst.endpoint = ZB_ENDPOINT_INTERPAN;
  RemoteWriteReq.count = 8;
  
  APP_DBG("Remotely writing Commissioning server attributes.");
  
  /* NWK address attribute */
  APP_DBG("Modifying NKK address.");
  RemoteWriteReq.attr[0].attrId = ZCL_COMMISSION_SVR_ATTR_SHORT_ADDR;
  RemoteWriteReq.attr[0].type = ZCL_DATATYPE_UNSIGNED_16BIT;
  putle16((uint8_t*)&nwk_addr, params->nwk_addr);
  RemoteWriteReq.attr[0].value = (uint8_t const*)&nwk_addr;
  RemoteWriteReq.attr[0].length = 2;
  
  /* Extended PAN ID attribute */
  APP_DBG("Modifying extended PAN ID.");
  RemoteWriteReq.attr[1].attrId = ZCL_COMMISSION_SVR_ATTR_EPID;
  RemoteWriteReq.attr[1].type = ZCL_DATATYPE_BITMAP_64BIT;
  putle64((uint8_t*)&epid, params->extendedPanID);
  RemoteWriteReq.attr[1].value = (uint8_t const*)&epid;
  RemoteWriteReq.attr[1].length = 8;
  
  /* Stack profile attribute */
  APP_DBG("Modifying stack profile.");
  RemoteWriteReq.attr[2].attrId = ZCL_COMMISSION_SVR_ATTR_STACKPROFILE;
  RemoteWriteReq.attr[2].type = ZCL_DATATYPE_UNSIGNED_8BIT;
  RemoteWriteReq.attr[2].value = (uint8_t const*)&params->stackProfile;
  RemoteWriteReq.attr[2].length = 1;
  
  /* Channel mask attribute */
  APP_DBG("Modifying channel mask.");
  RemoteWriteReq.attr[3].attrId = ZCL_COMMISSION_SVR_ATTR_CHANNELMASK;
  RemoteWriteReq.attr[3].type = ZCL_DATATYPE_BITMAP_32BIT;
  putle32((uint8_t*)&channelMask, 1 << params->channelMask);
  RemoteWriteReq.attr[3].value = (uint8_t const*)&channelMask;
  RemoteWriteReq.attr[3].length = 4;
  
  /* Use Insecure Join attribute */
  APP_DBG("Modifying insecure join.");
  RemoteWriteReq.attr[4].attrId = ZCL_COMMISSION_SVR_ATTR_USEINSECJOIN;
  RemoteWriteReq.attr[4].type = ZCL_DATATYPE_BOOLEAN;
  RemoteWriteReq.attr[4].value = (uint8_t const*)&params->useInsecureJoin;
  RemoteWriteReq.attr[4].length = 1;
  
  /* Preconfigured Link Key attribute */
  APP_DBG("Modifying preconfigured link key.");
  RemoteWriteReq.attr[5].attrId = ZCL_COMMISSION_SVR_ATTR_PRECONFLINKKEY;
  RemoteWriteReq.attr[5].type = ZCL_DATATYPE_SECURITY_KEY128;
  RemoteWriteReq.attr[5].value = (uint8_t const*)&sec_key_ha;
  RemoteWriteReq.attr[5].length = 16;
  
  /* Network Key type attribute */
  APP_DBG("Modifying NWK key type.");
  RemoteWriteReq.attr[6].attrId = ZCL_COMMISSION_SVR_ATTR_NWKKEYTYPE;
  RemoteWriteReq.attr[6].type = ZCL_DATATYPE_ENUMERATION_8BIT;
  RemoteWriteReq.attr[6].value = (uint8_t const*)&params->nwkKeyType;
  RemoteWriteReq.attr[6].length = 1;
  
