STMicroelectronics/STM32CubeWB/Projects/P-NUCLEO-WB55.Nucleo/Applications/Zigbee/Zigbee_Commissioning_Client_Coord/STM32_WPAN/App/app_zigbee.c
  /* Startup Control attribute */
  APP_DBG("Modifying startup control.");
  RemoteWriteReq.attr[7].attrId = ZCL_COMMISSION_SVR_ATTR_STARTUPCONTROL;
  RemoteWriteReq.attr[7].type = ZCL_DATATYPE_ENUMERATION_8BIT;
  RemoteWriteReq.attr[7].value = (uint8_t const*)&params->startupControl;
  RemoteWriteReq.attr[7].length = 1;
    
  status = ZbZclWriteReq(zigbee_app_info.commissioning_client, &RemoteWriteReq, APP_ZIGBEE_Commissioning_Client_RemoteWrite_cb, NULL);
  if (status != ZCL_STATUS_SUCCESS) {
    APP_DBG("Error, ZbZclWriteReq failed");
    assert(0);
  }
  
  UTIL_SEQ_WaitEvt(EVENT_ZIGBEE_CONTINUE_INIT);
  
  /* Remotely writing Commissioning client nwk configuration (request 2) */
  memset(&RemoteWriteReq, 0, sizeof(RemoteWriteReq));
  RemoteWriteReq.dst.mode = ZB_APSDE_ADDRMODE_EXT;
  /* We want to address any device with INTERPAN, 
   * even if not connected to ZC's network */
  RemoteWriteReq.dst.panId = ZB_PANID_WILDCARD; /* wildcard value */
  RemoteWriteReq.dst.extAddr = ZR_EXT_ADDR;
  RemoteWriteReq.dst.endpoint = ZB_ENDPOINT_INTERPAN;
  RemoteWriteReq.count = 1;
  
  APP_DBG("Remotely writing Commissioning server attributes.");
  
  /* Scan attempts attribute */
  APP_DBG("Modifying scan attempts.");
  RemoteWriteReq.attr[0].attrId = ZCL_COMMISSION_SVR_ATTR_SCANATTEMPTS;
  RemoteWriteReq.attr[0].type = ZCL_DATATYPE_UNSIGNED_8BIT;
  RemoteWriteReq.attr[0].value = (uint8_t const*)&params->scan_count;
  RemoteWriteReq.attr[0].length = 1;
  
  status =   ZbZclWriteReq(zigbee_app_info.commissioning_client, &RemoteWriteReq, APP_ZIGBEE_Commissioning_Client_RemoteWrite_cb, NULL);
  if (status != ZCL_STATUS_SUCCESS) {
    APP_DBG("Error, ZbZclWriteReq failed");
    assert(0);
  }
  
  UTIL_SEQ_WaitEvt(EVENT_ZIGBEE_CONTINUE_INIT);
  
  /* Saving Commissioning client nwk configuration */
  APP_DBG("Sending SaveStartup request."); 
  memset(&SaveStartupReq, 0, sizeof(SaveStartupReq));
  SaveStartupReq.index = config_num;
  status = ZbZclCommissionClientSendSaveStartup(zigbee_app_info.commissioning_client, ZR_EXT_ADDR, COMMISSIONING_DEST_ENDPOINT,&SaveStartupReq,
                                                APP_ZIGBEE_Generic_Cmd_Rsp_cb, NULL);
  if (status != ZCL_STATUS_SUCCESS) {
    APP_DBG("Error, ZbZclCommissionClientSendSaveStartup failed");
    assert(0);
  }
  
  /* Waiting the successful server response */
  UTIL_SEQ_WaitEvt(EVENT_ZIGBEE_CONTINUE_INIT);
  
  /* Resetting Commissioning client nwk configuration */
  APP_DBG("Sending ResetStartup request."); 
  memset(&ResetStartupReq, 0, sizeof(ResetStartupReq));
  status = ZbZclCommissionClientSendResetStartup(zigbee_app_info.commissioning_client, ZR_EXT_ADDR, COMMISSIONING_DEST_ENDPOINT,&ResetStartupReq, 
                                                 APP_ZIGBEE_Generic_Cmd_Rsp_cb, NULL);
  if (status != ZCL_STATUS_SUCCESS) {
    APP_DBG("Error, ZbZclCommissionClientSendResetStartup failed");
    assert(0);
  }
  
  /* Waiting the successful server response */
  UTIL_SEQ_WaitEvt(EVENT_ZIGBEE_CONTINUE_INIT);
  
  /* Sending Restore Startup command */
  APP_DBG("Sending RestoreStartup request."); 
  memset(&RestoreStartup, 0, sizeof(RestoreStartup));
  RestoreStartup.index = config_num;
  status = ZbZclCommissionClientSendRestoreStartup(zigbee_app_info.commissioning_client, ZR_EXT_ADDR, COMMISSIONING_DEST_ENDPOINT,&RestoreStartup,
                                                   APP_ZIGBEE_Generic_Cmd_Rsp_cb, NULL);
  if (status != ZCL_STATUS_SUCCESS) {
    APP_DBG("Error, ZbZclCommissionClientSendResetStartup failed");
    assert(0);
  }
  
  /* Waiting the successful server response */
  UTIL_SEQ_WaitEvt(EVENT_ZIGBEE_CONTINUE_INIT);
  
  /* Sending RestartDevice command */
  APP_DBG("Sending RestartDevice request."); 
  memset(&RestartDeviceReq, 0, sizeof(RestartDeviceReq));
  
  /* We want the receiver to install the current set of startup parameters before restarting */
  RestartDeviceReq.options = ZCL_COMMISS_RESTART_OPTS_MODE_USE_STARTUP;
  RestartDeviceReq.delay = ZR_RESTART_DEVICE_DELAY;
  status = ZbZclCommissionClientSendRestart(zigbee_app_info.commissioning_client, ZR_EXT_ADDR, COMMISSIONING_DEST_ENDPOINT,&RestartDeviceReq,
                                            APP_ZIGBEE_Generic_Cmd_Rsp_cb, NULL);
  if (status != ZCL_STATUS_SUCCESS) {
    APP_DBG("Error, ZbZclCommissionClientSendRestart failed");
    assert(0);
  }
  
  /* Waiting the successful server response */
  UTIL_SEQ_WaitEvt(EVENT_ZIGBEE_CONTINUE_INIT);
  
  APP_DBG("Commissioning process successfully ended.\n");
}

/**
 * @brief  Zigbee application helper to show network information
 * @param  None
 * @retval None
 */
static void APP_ZIGBEE_NwkInfo(void){
  struct ZbNlmeGetInterfaceReqT ZbNlmeReq;
  struct ZbNlmeGetInterfaceConfT ZbNlmeConf;
  uint64_t epid = 0;
  uint32_t channelInUse = 0 ;
  
  /* Extended Pan ID */
  if(ZbNwkGet(zigbee_app_info.zb, ZB_NWK_NIB_ID_ExtendedPanId, &epid, sizeof(epid)) != ZB_STATUS_SUCCESS){
    APP_DBG("Error, ZbNwkGet failed.");
    return; 
  }
  APP_DBG("Extended PAN ID: 0x%" PRIx64 "\n.", epid);
  
  /* Channel in use */
  
  /* NLME-GET-INTERFACE.request */
  memset(&ZbNlmeReq, 0, sizeof(ZbNlmeReq));
  memset(&ZbNlmeConf, 0, sizeof(ZbNlmeConf));
  ZbNlmeReq.ifcIndex = 0; /* interface 0 */
  
  ZbNlmeGetInterface(zigbee_app_info.zb, &ZbNlmeReq, &ZbNlmeConf);
  if (ZbNlmeConf.status != ZB_STATUS_SUCCESS) {
    APP_DBG("Error, ZbNlmeGetInterface failed.");
    return;
  }
  
  /* Current channel */
  while (!(ZbNlmeConf.channelInUse & 1)) {  
    /* Iterate through bits until we find the only set bit */
    ZbNlmeConf.channelInUse = ZbNlmeConf.channelInUse >> 1;
    ++channelInUse; 
  } 
  
  APP_DBG("Channel in use: %d\n.", channelInUse);
}

/**
 * @brief  Zigbee application initialization
 * @param  None
 * @retval None
 */
static void APP_ZIGBEE_App_Init(void){
  /* Initialize Zigbee Commissioning Client parameters */
  APP_ZIGBEE_Commissioning_Client_Init();
} /* APP_ZIGBEE_App_Init */

/**
 * @brief  Commissioning client initialization
 * @param  None
 * @retval None
 */
static void APP_ZIGBEE_Commissioning_Client_Init(void){
  /* Show NWK info */
  APP_ZIGBEE_NwkInfo();
  
  APP_DBG("Commissioning client init done!\n");  
} /* APP_ZIGBEE_Commissioning_Client_Init */

/**
 * @brief  Device generic remote write response callback
 * @param  writeResp: ZCL write response
 * @param  cb_arg: passed arguments
 * @retval None
 */
static void APP_ZIGBEE_Commissioning_Client_RemoteWrite_cb(const ZbZclWriteRspT *writeResp, void *cb_arg){
   UNUSED(cb_arg);
   
